#include "Sea.h"
#include "gui_generated.h"
#include "ofxKuMessageLog.h"

Sea SEA;

//--------------------------------------------------------------
void Sea::setup() {

}

//--------------------------------------------------------------
void Sea::update() {

}

//--------------------------------------------------------------
void Sea::draw() {


}

//--------------------------------------------------------------
//добавить слово
//buffer с запасом, надо взять n
void Sea::push_word(const vector<float> &buffer, int n) {
	if (n <= 0) return;
}

//--------------------------------------------------------------
